Котельников_АБ_70153995/src/Documents/ПроведениеТестирования/ПроведениеТестирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроведениеТестирования</name>
  <basedOn>Document.ПроведениеСобеседования</basedOn>
  <registerRecords>AccumulationRegister.ОценкиКандидатов</registerRecords>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПроведениеСобеседования</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыТестирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансия</types>
    </type>
  </attributes>
  <attributes>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </attributes>
  <attributes>
    <name>АнкетаВопросов</name>
    <type>
      <types>CatalogRef.Анкеты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяОценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокВопросов</name>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>CatalogRef.ВопросыДляАнкетирования</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветКандидата</name>
      <type>
        <types>EnumRef.ТипыОценкиОтвета</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Котельников_АБ_70153995/src/Documents/ПроведениеТестирования/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПроведениеТестирования.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПроведениеТестирования.Вакансия) КАК Вакансия,
	|	ПроведениеТестирования.ВремяНачала КАК ВремяНачала,
	|	ПроведениеТестирования.ВремяОкончания КАК ВремяОкончания,
	|	ПроведениеТестирования.Дата КАК Дата,
	|	ПроведениеТестирования.Кандидат КАК Кандидат,
	|	ПроведениеТестирования.Номер КАК Номер,
	|	ПроведениеТестирования.Ответственный КАК Ответственный,
	|	ПроведениеТестирования.СписокВопросов.(
	|		НомерСтроки КАК НомерСтроки,
	|		Вопрос КАК Вопрос,
	|		Вопрос.Формулировка КАК ВопросФормулировка
	|	) КАК СписокВопросов,
	|	ПроведениеТестирования.Вакансия.Должность КАК ВакансияДолжность
	|ИЗ
	|	Документ.ПроведениеТестирования КАК ПроведениеТестирования
	|ГДЕ
	|	ПроведениеТестирования.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокВопросовШапка = Макет.ПолучитьОбласть("СписокВопросовШапка");
	ОбластьСписокВопросов = Макет.ПолучитьОбласть("СписокВопросов");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);
		Шапка.Параметры.Заполнить(Выборка);
		
		ДатаПроведения = Формат(Выборка.Дата, "ДЛФ=DD");
		
		ПоследнийПробел = СтрНайти(Выборка.Вакансия, " ", НаправлениеПоиска.СКонца);
		Вакансия = Сред(Выборка.Вакансия, 0, ПоследнийПробел - 1);
		
		ВремяНачала = Формат(Выборка.ВремяНачала, "ДЛФ=T");
		ВремяОкончания = Формат(Выборка.ВремяОкончания, "ДЛФ=T");
		Шапка.Параметры.Дата = ДатаПроведения;
		Шапка.Параметры.Вакансия = Вакансия;
		Шапка.Параметры.ВремяНачала	= ВремяНачала;
		Шапка.Параметры.ВремяОкончания = ВремяОкончания;
		
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьСписокВопросовШапка);
		ВыборкаСписокВопросов = Выборка.СписокВопросов.Выбрать();
		Пока ВыборкаСписокВопросов.Следующий() Цикл
			ОбластьСписокВопросов.Параметры.Заполнить(ВыборкаСписокВопросов);
			ТабДок.Вывести(ОбластьСписокВопросов, ВыборкаСписокВопросов.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
